### ordinal number encoding

In [1]:
import datetime

In [2]:
today_date=datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2022, 11, 14, 13, 46, 56, 902085)

In [4]:
today_date-datetime.timedelta(3)

datetime.datetime(2022, 11, 11, 13, 46, 56, 902085)

In [5]:
### list comprehension
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [6]:
import pandas as pd
data=pd.DataFrame(days)

In [7]:
data.columns=['Days']

In [8]:
data.head()

                        Days
0 2022-11-14 13:46:56.902085
1 2022-11-13 13:46:56.902085
2 2022-11-12 13:46:56.902085
3 2022-11-11 13:46:56.902085
4 2022-11-10 13:46:56.902085

In [9]:
data['weekdays']=data['Days'].dt.day_name()
data.head()

                        Days  weekdays
0 2022-11-14 13:46:56.902085    Monday
1 2022-11-13 13:46:56.902085    Sunday
2 2022-11-12 13:46:56.902085  Saturday
3 2022-11-11 13:46:56.902085    Friday
4 2022-11-10 13:46:56.902085  Thursday

In [10]:
dictionary={'Monday':1,'Tuesday':2,'Wednesday':3,'Thursday':4,'Friday':5,'Saturday':6,'Sunday':7}
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [11]:
data['weekdays_ordinal']=data['weekdays'].map(dictionary)

In [12]:
data

                         Days   weekdays  weekdays_ordinal
0  2022-11-14 13:46:56.902085     Monday                 1
1  2022-11-13 13:46:56.902085     Sunday                 7
2  2022-11-12 13:46:56.902085   Saturday                 6
3  2022-11-11 13:46:56.902085     Friday                 5
4  2022-11-10 13:46:56.902085   Thursday                 4
5  2022-11-09 13:46:56.902085  Wednesday                 3
6  2022-11-08 13:46:56.902085    Tuesday                 2
7  2022-11-07 13:46:56.902085     Monday                 1
8  2022-11-06 13:46:56.902085     Sunday                 7
9  2022-11-05 13:46:56.902085   Saturday                 6
10 2022-11-04 13:46:56.902085     Friday                 5
11 2022-11-03 13:46:56.902085   Thursday                 4
12 2022-11-02 13:46:56.902085  Wednesday                 3
13 2022-11-01 13:46:56.902085    Tuesday                 2
14 2022-10-31 13:46:56.902085     Monday                 1

# count or freqency encoding

In [13]:
train_set = pd.read_csv('http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data' , header = None,index_col=None)
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [14]:
columns=[1,3,5,6,7,8,9,13]

In [15]:
train_set=train_set[columns]

In [16]:
train_set.columns=['employment','Degree','status','Designation','family_job','Race','sex','country']

In [17]:
train_set.head()

,employment,Degree,status,Designation,family_job,Race,sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [18]:
for feature in train_set.columns:
    print(feature,':',len(train_set[feature].unique()),'labels')

employment : 9 labels
Degree : 16 labels
status : 7 labels
Designation : 15 labels
family_job : 6 labels
Race : 5 labels
sex : 2 labels
country : 42 labels

In [25]:
dictionarys=train_set['country'].value_counts().to_dict()

In [27]:
train_set['country']=train_set['country'].map(dictionarys)

In [29]:
train_set

,employment,Degree,status,Designation,family_job,Race,sex,country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,29170
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,29170
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,29170
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,29170
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,95
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,29170
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,29170
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,29170
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,29170
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,29170

##### advantages
1. easy to use
2. not increasing feature space
##### disadvantages
1. it will provide same weight if the frequency are same

## Target guided ordinal encoding
1. ordering the label according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [31]:
import pandas as pd 
import numpy as np
df=pd.read_csv('titanic_train.csv', usecols=['Cabin','Survived'])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [32]:
df['Cabin'].fillna('missing',inplace=True)

In [33]:
df.head()

   Survived    Cabin
0         0  missing
1         1      C85
2         1  missing
3         1     C123
4         0  missing

In [37]:
df['Cabin']=df['Cabin'].astype(str).str[0]

In [38]:
df.head()

   Survived Cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [39]:
df['Cabin'].unique()

array(['m', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [40]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: Survived, dtype: float64

In [41]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [42]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [43]:
ordinal_labels

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [59]:
ordinal_labels2={k:i for i,k in enumerate(ordinal_labels,0)}

In [60]:
ordinal_labels2

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [63]:
df['ordinal_cabin_labels']=df['Cabin'].map(ordinal_labels2)
df.head()

   Survived Cabin  ordinal_labels3  ordinal_cabin_labels
0         0     m                1                     1
1         1     C                4                     4
2         1     m                1                     1
3         1     C                4                     4
4         0     m                1                     1